app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT `applications`.* FROM `applications`

  def update
    @application = Application.lock.find_by(application_token: params[:application_token])
    if @application.update(application_params)
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'token1' LIMIT 1 FOR UPDATE
UPDATE `applications` SET `name` = 'app2', `updated_at` = '2021-06-05 19:40:09' WHERE `applications`.`id` = 17

    def set_application
      @application = Application.find_by(application_token: params[:application_token])
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'token1' LIMIT 1