app/controllers/chats_controller.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 16 AND `chats`.`number` = 1 LIMIT 1
---
  def show
    @chat = @application.chats.find_by(number: params[:number])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 16 AND `chats`.`number` = 1 LIMIT 1
---
  def update
    @chat = @application.chats.find_by(number: params[:number])

SELECT  `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'token1' LIMIT 1
---
    def set_application
      @application = Application.find_by(application_token: params[:application_application_token])