app/controllers/messages_controller.rb

  def show
    @message = @chat.messages.find_by(number: params[:number])
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 10 AND `messages`.`number` = 1 LIMIT 1

  def update
    @message = @chat.messages.lock.find_by(number: params[:number])

    if @message.update(message_params)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 10 AND `messages`.`number` = 4 LIMIT 1 FOR UPDATE
UPDATE `messages` SET `content` = 'other random content', `updated_at` = '2021-06-05 21:13:56' WHERE `messages`.`id` = 8

    def set_chat
      @application = Application.find_by(application_token: params[:application_application_token])

      @chat = @application.present? ? @application.chats.find_by(number: params[:chat_number]) : nil
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'token3' LIMIT 1
SELECT  1 AS one FROM `chats` WHERE `chats`.`application_id` = 16 AND (`chats`.`id` != 10) AND `chats`.`number` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 18 AND `chats`.`number` = 2 LIMIT 1