app/controllers/search_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`id` IN (9, 10, 17) AND `messages`.`chat_id` = 27
---
	def search
   	    @messages = []
		if params[:q].present?
	      	@messages = Message.search(
	      		{
			      _source: false,
				  query: {
				    bool: {
				      must: [
				        { match_phrase_prefix: {
				        	content: {query: params[:q]}
				        }}
				      ],
				      filter: [
				        { term:  { chat_id: @chat.id }}
				      ]
				    }
				  },
				  fields: ["number", "content"]
			    }
	      	).select { |m| m.delete("_id") }

SELECT  `applications`.* FROM `applications` WHERE `applications`.`application_token` = 'token1' LIMIT 1
SELECT  1 AS one FROM `chats` WHERE `chats`.`application_id` = 1 AND (`chats`.`id` != 1) AND `chats`.`number` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 16 AND `chats`.`number` = 1 LIMIT 1
---
  	  def set_chat
        @application = Application.find_by(application_token: params[:application_application_token])
        @chat = @application.present? ? @application.chats.find_by(number: params[:chat_number]) : nil